[
    {
        "title": "Russia-Ukraine war: List of key events – day 1,094",
        "summary": "A Russian drone attack killed a rail worker at a crossing in the Boryspil district, east of Kyiv. Falling drone fragments hit a building inside the capital, Kyiv Mayor Vitali Klitschko said. US President Donald Trumphas reversed course and said Russia did in fact invade Ukraine.",
        "link": "https://www.aljazeera.com/news/2025/2/22/russia-ukraine-war-list-of-key-events-day-1094"
    },
    {
        "title": "Israeli army kills 2 Palestinian children in occupied West Bank",
        "summary": "Ayman Nasser al-Haymouny, 12, was killed in Hebron. Rimas al-Amouri, 13, was shot in the Jenin governorate. Soldiers fired on both children from inside armored military vehicles.",
        "link": "https://www.aljazeera.com/news/2025/2/22/two-children-killed-in-occupied-west-bank-as-israel-steps-up-sweeping-raids"
    },
    {
        "title": "Hamas releases remains of captive Bibas after ‘mix-up of bodies’",
        "summary": "Israel's Bibas family confirms that the remains of Shiri Bibas have been returned by Hamas. Family members and forensic experts confirm that the new remains turned over by Hamas belong to the deceased Bibas. Hamas had agreed to hand over the bodies of Bibas and her husband under the Gaza ceasefire deal.",
        "link": "https://www.aljazeera.com/news/2025/2/22/hamas-releases-remains-of-captive-shiri-bibas-after-mix-up-of-bodies"
    },
    {
        "title": "Two of six Israeli captives freed in Gaza, second handover to follow",
        "summary": "Two Israeli captives have been freed in Rafah, four more to be released shortly in Nuseirat. Al Jazeera Live Follow Al Jazeera English on Facebook and Twitter. Back to the page you came from. Follow us on Twitter and Facebook.",
        "link": "https://www.aljazeera.com/news/liveblog/2025/2/22/live-six-israeli-captives-to-be-exchanged-for-602-palestinian-prisoners"
    },
    {
        "title": "Why a news site in Ireland has been drawn into JD Vance’s attacks on Europe",
        "summary": "Gript, a news site known for its conservative stances on culture war issues, announced this week that Irish police last year obtained a court order to access private messages and IP addresses associated with its X account. Gript, which purports to cover the news without the “liberal filter”, called the move an “intolerable” and “egregious” attack on privacy and media freedom.",
        "link": "https://www.aljazeera.com/news/2025/2/21/why-an-irish-news-site-has-been-drawn-into-jd-vances-attacks-on-europe"
    },
    {
        "title": "What can stop M23 advance in Democratic Republic of the Congo?",
        "summary": "US trade taxes on Canada and Mexico have been paused for 30 days. Thousands of employees have been placed on leave and aid recipients in more than 130 countries have been left in limbo. The International Criminal Court receives a wave of support after it’s hit with US sanctions.",
        "link": "https://www.aljazeera.com/program/inside-story/"
    },
    {
        "title": "Trump ramps up Zelenskyy attacks as US official says mineral deal close",
        "summary": "US president unrelenting in criticism of President Volodymyr Zelenskyy. Comes amid wider US policy shift on the conflict from the Trump administration. Trump again laid the blame for the destruction wrought by Russia’s invasion of Ukraine on the Ukrainian leader.",
        "link": "https://www.aljazeera.com/news/2025/2/21/trump-ramps-up-zelenskyy-attacks-as-us-official-says-mineral-deal-close"
    },
    {
        "title": "Sinn Fein leaders to boycott White House visit over US Gaza plan",
        "summary": "Sinn Fein leaders say they will not attend St Patrick’s Day events at the White House. Northern Ireland First Minister Michelle O’Neill says she is ‘heartbroken’ by the suffering of the Palestinian people. Sinn Fein party leader Mary Lou McDonald says she could not visit Washington ‘while there was a threat of mass expulsion hanging over the PalestinianPeople’",
        "link": "https://www.aljazeera.com/news/2025/2/21/sinn-fein-leaders-to-boycott-white-house-visit-over-us-gaza-plan"
    },
    {
        "title": "France’s Bardella cancels CPAC speech after Steve Bannon’s ‘Nazi’ gesture",
        "summary": "Jordan Bardellahas said he cancelled a planned speech at a right-wing meeting in Washington after a ‘gesture alluding to Nazi ideology’ The president of the National Rally (RN) party said he was not present when Steve Bannon made an apparent fascist-style gesture.",
        "link": "https://www.aljazeera.com/news/2025/2/21/frances-bardella-cancels-cpac-speech-after-bannon-nazi-gesture"
    },
    {
        "title": "Apple, in a first, drops end-to-end cloud encryption for UK users",
        "summary": "Apple will stop offering advanced data security option for British users. Move comes after UK security officials demanded backdoor access to the encrypted material, Washington Post said. Advanced Data Protection is an opt-in feature that protects iCloud files, photos, notes and other data with end-to-end encryption when they’re stored in the cloud.",
        "link": "https://www.aljazeera.com/economy/2025/2/21/apple-in-a-first-drops-end-to-end-cloud-encryption-for-uk-users"
    },
    {
        "title": "Arab leaders discuss alternative to Trump Gaza plan at Saudi Arabia meet",
        "summary": "Leaders of seven Arab countries hold talks in Saudi Arabia to hash out plan for future of Gaza. Meeting was meant to respond to aplan raised by US President Donald Trump for the US to ‘take over’ Gaza. Arab leaders haveroundly rejectedTrump’s proposal, saying it throws out decades of work towards Palestinian self-determination.",
        "link": "https://www.aljazeera.com/news/2025/2/21/arab-leaders-discuss-alternative-to-trump-gaza-plan-at-saudi-arabia-meet"
    },
    {
        "title": "Hermoso will appeal Rubiales ‘forced kiss’ verdict",
        "summary": "Luis Rubiales was fined after being found guilty of a forced kiss on the Women’s World Cup-winning player. Prosecutors had sought a prison term for ex-football chief for assault and coercion against Jenni Hermoso. “It is her intention” to appeal, lawyer Angel Chavarria said.",
        "link": "https://www.aljazeera.com/sports/2025/2/21/hermoso-will-appeal-rubiales-forced-kiss-verdict"
    },
    {
        "title": "South Africa and Rickelton routs Afghanistan in Champions Trophy",
        "summary": "South Africa beat Afghanistan by 107 runs in Champions Trophy opener. Ryan Rickelton hits maiden one-day international hundred for South Africa. Kagiso Rabada, Wiaan Mulder and Lungi Ngidi take three wickets each. Afghanistan bowled out for 208 in 43.3 overs.",
        "link": "https://www.aljazeera.com/sports/2025/2/21/icc-champions-trophy-2025-south-africa-beat-afghanistan-by-107-runs"
    },
    {
        "title": "Pope Francis’s condition not life threatening, medical team says",
        "summary": "The pontiff is responding to drug therapy and sepsis has not been detected. He is likely to remain in hospital ‘at least all next week’ as there is still a risk that the infection could spread to other parts of the body.",
        "link": "https://www.aljazeera.com/news/2025/2/21/pope-franciss-condition-not-life-threatening-medical-team-says"
    }
]